=begin
  処理フロー案
  投手
  123
  456
  789
  という枠に投球する

  打者
  123
  456
  789
  のどこを打つか選択する

  数字ドンピシャなら確実に安打
    ホームラン低確率
    高確率で長打
    低確率で短打
  同じ行列ならそれなりの確率で安打
    ホームラン無し
    低確率で長打
    高確率で短打
  そこ以外は低確率で安打
    ホームラン無し
    長打無し
    短打のみ
=end

# ruby baseball.rb
puts "投手：投球コースを選択してください"
puts <<"EOS"
-------
|1|2|3|
|4|5|6|
|7|8|9|
-------
EOS

pitcher = gets.to_i
puts pitcher

puts "打者：狙うコースを選択してください"
puts <<"EOS"
-------
|1|2|3|
|4|5|6|
|7|8|9|
-------
EOS

batter = gets.to_i
puts batter

if pitcher == batter
  p "ホームラン！"
end